//------------------------------------------------------------------------------
#include "dev_conf.h"
//------------------------------------------------------------------------------
//STM32F103C8T6
//------------------------------------------------------------------------------
//Для прошивки плата STM32F4-DISCO
///*****************************************************************************
//--STM32F4-DISCO-------CAN4------Убрать перемычки------------------------------
//--STM32F4-DISCO--->---STM32F103C8T6-------------------------------------------
//1-AIN---------------------NC--------------------------------------------------
//2-TCK/SWCLK---------------DCLK------------------------------------------------
//3-GND---------------------GND-------------------------------------------------
//4-TMS/SWIO----------------DIO-------------------------------------------------
//5 Reset-------------------Reset-----------------------------------------------
//6-SWO---------------------NC--------------------------------------------------
///*****************************************************************************
//SWD------------GND---DCLK---DIO---+3.3V---------------------------------------
///*****************************************************************************
//STM32F103C8T6-BOOT0------------------0----------------------------------------
//STM32F103C8T6-BOOT1------------------0----------------------------------------
///*****************************************************************************
//VBAT(3.3в)------------STM32F103C8T6-------------------------------------------
//PC_13(3.3в)---------------------------LED1------------------------------------
//PC_14(3.3в)-------------------------------------------------------------------
//PC_15(3.3в)-------------------------------------------------------------------
//PA_0(3.3в)----A0----------------------AIN-------------------------------------
//PA_1(3.3в)----A1----------------------AIN---------PWM2/2----------------------
//PA_2(3.3в)----D1------UART2_TX--------AIN---------PWM2/3----------------------
//PA_3(3.3в)----D0------UART2_RX--------AIN---------PWM2/4----------------------
//PA_4(3.3в)----A2------SPI1_NSS--------AIN-------------------------------------
//PA_5(3.3в)----D13-----SPI1_SCL--------AIN-------------------------------------
//PA_6(3.3в)----D12-----SPI1_MISO-------AIN---------PWM3/1----------------------
//PA_7(3.3в)----D11-----SPI1_MOSI-------AIN---------PWM3/2----------------------
//PB_0(3.3в)----A3----------------------AIN---------PWM3/3----------------------
//PB_1(3.3в)----------------------------AIN---------PWM3/4----------------------
//PB_10(5в)-----D6------UART3_TX--------I2C2_SCL----PWM2/3----------------------
//PB_11(5в)-------------UART3_RX--------I2C2_SDA----PWM2/4----------------------
//RESET-----------------------------------------------------------(*)-----------
//+3.3V-------------------------------------------------------------------------
//GND---------------------------------------------------------------------------
//GND---------------------------------------------------------------------------
///*****************************************************************************
//3.3в------------------STM32F103C8T6-------------------------------------------
//GND---------------------------------------------------------------------------
//+5в---------------------------------------------------------------------------
//PB_9(5в)------D14-----CAN1_TD---------I2C1_SDA------------------(*)-----------
//PB_8(5в)------D15-----CAN1_RD---------I2C1_SCL------------------(*)-----------
//PB_7(5в)--------------UART1_RX--------I2C1_SDA------------------(*)-----------
//PB_6(5в)------D10-----UART1_TX--------I2C1_SCL------------------(*)-----------
//PB_5(3.3в)----D4------SPI1_MOSI-------PWM3/2----------------------------------
//PB_4(5в)------D5------SPI1_MISO-------PWM3/1----------------------------------
//PB_3(5в)------D3------SPI1_SCL--------PWM2/2----------------------------------
//PA_15(5в)-------------SPI1_NSS--------PWM2/1----------------------------------
//PA_12(5в)-----USB_DP--CAN1_TD-------------------------------------------------
//PA_11(5в)-----USB_DM--CAN1_RD---------PWM1/4----------------------------------
//PA_10(5в)-----D2------UART1_RX--------PWM1/3----------------------------------
//PA_9(5в)------D8------UART1_TX--------PWM1/2--------------------(*)-----------
//PA_8(5в)------D7----------------------PWM1/1--------------------(*)-----------
//PB_15(5в)-------------SPI2_MOSI-------PWM1/3N-------------------(*)-----------
//PB_14(5в)-------------SPI2_MISO-------PWM1/2N---------------------------------
//PB_13(5в)-------------SPI2_SCL--------PWM1/1N-------------------(*)-----------
//PB_12(5в)-------------SPI2_NSS----------------------------------(*)-----------
///*****************************************************************************
//STM32F103C8T6---------HD44780_I2C Дисплей-------------------------------------
//(PB_6)I2C1_SCL--------HD44780_I2C_SCL(подтяжка к +3.3в через резистор 4.7к)---
//(PB_7)I2C1_SDA--------HD44780_I2C_SDA(подтяжка к +3.3в через резистор 4.7к)---
///*****************************************************************************
//STM32F103C8T6---------MAX2719 LED BOARD---------------------------------------
//----------------------(+5в)---------------------------------------------------
//----------------------GND-----------------------------------------------------
//------------------------------------------------------------------------------
//NC--------------------NC------------------------------------------------------
//(B9)------------------BOTTOM1---------КНОПКА1---------------------------------
//(B8)------------------BOTTOM2---------КНОПКА2---------------------------------
//SPI2_MOSI(PB_15)------DIN-----(подтяжка к +5в через резистор 4.7к)------------
//SPI2_NSS(PB_12)-------CS------(подтяжка к +5в через резистор 4.7к)------------
//SPI2_SCL(PB_13)-------SCL-----(подтяжка к +5в через резистор 4.7к)------------
///*****************************************************************************
//STM32F103C8T6---------Светодиод-----------------------------------------------
//(PA_9)----------------LED(резистор 620 Ом)------------------------------------
///*****************************************************************************
//STM32F103C8T6---------Для отладки---------------------------------------------
//UART1_TX(PA_9)--------(Arduino nano 5)TX1(без прошивки и загрузчика)----------
////////////////////////////////////////////////////////////////////////////////
///***************************LED Display************************************///
////////////////////////////////////////////////////////////////////////////////
//Настойка выводов LED дисплея
static const GPIO_Device MAX2719_GPIO_Init[] = {
	{
		.gpio_init = {
			.Mode		=	GPIO_MODE_OUTPUT_OD,
			.Speed		=	GPIO_SPEED_FREQ_HIGH,
			.Pull		=	GPIO_NOPULL,
			.Pin		=	GPIO_PIN_12,	//SPI2_NSS
		},
		.gpio_type	=	GPIOB,
	},{
		.gpio_init = {
			.Mode		=	GPIO_MODE_AF_OD,
			.Speed		=	GPIO_SPEED_FREQ_HIGH,
			.Pull		=	GPIO_NOPULL,
			.Pin		=	GPIO_PIN_13 |	//SPI2_SCK
							GPIO_PIN_15,	//SPI2_MOSI
		},
		.gpio_type	=	GPIOB,
	}
};
//------------------------------------------------------------------------------
static MAX2719_DevDevice	MAX2719_Init = {
	.spi =  {
		.hspi = {
			.Instance = SPI2,
			.Init = {
				.Mode				= SPI_MODE_MASTER,
				.Direction			= SPI_DIRECTION_2LINES,
				.DataSize			= SPI_DATASIZE_16BIT,
				.CLKPolarity		= SPI_POLARITY_LOW,
				.CLKPhase			= SPI_PHASE_1EDGE,
				.NSS				= SPI_NSS_SOFT,
				.BaudRatePrescaler	= SPI_BAUDRATEPRESCALER_256,
				.FirstBit			= SPI_FIRSTBIT_MSB,
				.TIMode				= SPI_TIMODE_DISABLE,
				.CRCCalculation		= SPI_CRCCALCULATION_DISABLE,
				.CRCPolynomial		= 10,
			}
		},
		.pins = MAX2719_GPIO_Init,
		.pins_size = ARRAY_SIZE(MAX2719_GPIO_Init),
	},
	.NSS = 0,
};
////////////////////////////////////////////////////////////////////////////////
///***************************BUTTOM*****************************************///
////////////////////////////////////////////////////////////////////////////////
 //Настойка выводов клавиатуры
static const GPIO_Device BUTTOM_GPIO_Init[] = {
	{
		.gpio_init = {
			.Mode		=	GPIO_MODE_INPUT,
			.Speed		=	GPIO_SPEED_FREQ_HIGH,
			.Pull		=	GPIO_PULLDOWN,
			.Pin		=	GPIO_PIN_9,
		},
		.gpio_type	=	GPIOB,
	},{
		.gpio_init = {
			.Mode		=	GPIO_MODE_INPUT,
			.Speed		=	GPIO_SPEED_FREQ_HIGH,
			.Pull		=	GPIO_PULLDOWN,
			.Pin		=	GPIO_PIN_8,
		},
		.gpio_type	=	GPIOB,
	}
};
//------------------------------------------------------------------------------
static BUTTOM_Device	BUTTOM_Init = {
	.pins = BUTTOM_GPIO_Init,
	.pins_size = ARRAY_SIZE(BUTTOM_GPIO_Init),
	.count_ready = 5,
};
////////////////////////////////////////////////////////////////////////////////
///***************************LCD Display************************************///
////////////////////////////////////////////////////////////////////////////////
//Настойка выводов LСD дисплея
static GPIO_Device HD44780_I2C_GPIO_Init[] = {
	{
		.gpio_init = {
			.Mode		= GPIO_MODE_AF_OD,
			.Speed		= GPIO_SPEED_FREQ_HIGH,
			.Pin		= GPIO_PIN_7,	//I2C_SDA
		},
		.gpio_type	= GPIOB,
	},{
		.gpio_init = {
			.Mode		= GPIO_MODE_AF_OD,
			.Speed		= GPIO_SPEED_FREQ_HIGH,
			.Pin		= GPIO_PIN_6,	//I2C_SCL
		},
		.gpio_type	= GPIOB,
	}
};
//------------------------------------------------------------------------------
static HD44780_I2C_Device HD44780_I2C_Init = {
	.pcf8574 = {
		.i2c = {
			.hi2c = {
					.Instance = I2C1,
					.Init = {
					.ClockSpeed			= 100000,
					.DutyCycle			= I2C_DUTYCYCLE_2,
					.OwnAddress1		= 0,
					.AddressingMode		= I2C_ADDRESSINGMODE_7BIT,
					.DualAddressMode	= I2C_DUALADDRESS_DISABLE,
					.OwnAddress2		= 0,
					.GeneralCallMode	= I2C_GENERALCALL_DISABLE,
					.NoStretchMode		= I2C_NOSTRETCH_DISABLE,
				}
			},
			.pins = HD44780_I2C_GPIO_Init,
			.pins_size = ARRAY_SIZE(HD44780_I2C_GPIO_Init),
		},
		.i2c_addr = 0x27,
	}
};
////////////////////////////////////////////////////////////////////////////////
///***************************RTC********************************************///
////////////////////////////////////////////////////////////////////////////////
//Обработчик прерывания с rtc
static void rtc_event_callback(RTC_HandleTypeDef *hrtc)
{
	UNUSED(hrtc);
	RandRollDevice.flag_update_1hz = 1;
}
//------------------------------------------------------------------------------
static RTC_Device RTC_Init = {
	.hrtc = {
		.Instance = RTC,
		.Init = {
			.AsynchPrediv	= RTC_AUTO_1_SECOND,
			.OutPut			= RTC_OUTPUTSOURCE_NONE,
		},
	},
	.time = {
		.Hours		= 0x0,
		.Minutes	= 0x0,
		.Seconds	= 0x0,
	},
	.date = {
		.WeekDay	= RTC_WEEKDAY_MONDAY,
		.Month		= RTC_MONTH_JANUARY,
		.Date		= 0x1,
		.Year		= 0x0,
	},
	.rtc_event_callback = &rtc_event_callback,
};
////////////////////////////////////////////////////////////////////////////////
///***************************TIMER3*****************************************///
////////////////////////////////////////////////////////////////////////////////
//Обработчик прерывания с таймера 3
static void tim3_period_elapsed_callback(TIM_HandleTypeDef *htim)
{
	UNUSED(htim);

	RandRollDevice.flag_update_100hz = 1;

	static int tim3_count_10_hz = 0;
	static int tim3_count_2_hz = 0;

	if(tim3_count_10_hz < 10 - 1) {
		tim3_count_10_hz++;
	} else {
		tim3_count_10_hz=0;
		RandRollDevice.flag_update_10hz = 1;
	}

	if(tim3_count_2_hz < 50 - 1) {
		tim3_count_2_hz++;
	} else {
		tim3_count_2_hz = 0;
		RandRollDevice.flag_update_2hz = 1;
	}
}
//------------------------------------------------------------------------------
static TIM_Base_Device TIM3_Base_Init = {
	.htim = {
		.Instance = TIM3,
		.Init = {
			.Prescaler			= (uint32_t) ((72000000) / 10000) - 1,
			.Period				= 100 - 1,
			.ClockDivision		= 0,
			.CounterMode		= TIM_COUNTERMODE_UP,
			.AutoReloadPreload	= TIM_AUTORELOAD_PRELOAD_DISABLE,
		},
	},
	.period_elapsed_callback = &tim3_period_elapsed_callback,
};
////////////////////////////////////////////////////////////////////////////////
///***************************UART DEBUG*************************************///
////////////////////////////////////////////////////////////////////////////////
//Настойка выводов uart
static const GPIO_Device UART_Debug_GPIO_Init[] = {
	{
		.gpio_init = {
			.Mode				= GPIO_MODE_AF_PP,
			.Speed				= GPIO_SPEED_FREQ_HIGH,
			.Pull				= GPIO_NOPULL,
			.Pin				= GPIO_PIN_9,	//UART_TX
		},
		.gpio_type		= GPIOA,
	}
};
//------------------------------------------------------------------------------
static UART_Device UART_Debug_Init = {

	.huart = {
		.Instance = USART1,
		.Init = {
			.BaudRate			= 115200,
			.WordLength			= UART_WORDLENGTH_8B,
			.StopBits			= UART_STOPBITS_1,
			.Parity				= UART_PARITY_NONE,
			.Mode				= UART_MODE_TX_RX,
			.HwFlowCtl			= UART_HWCONTROL_NONE,
			.OverSampling		= UART_OVERSAMPLING_16,
		}
	},
	.pins = UART_Debug_GPIO_Init,
	.pins_size = ARRAY_SIZE(UART_Debug_GPIO_Init),
};
////////////////////////////////////////////////////////////////////////////////
///***************************RCC********************************************///
////////////////////////////////////////////////////////////////////////////////
static  RCC_Device RCC_Init = {
	.osc = {
		.OscillatorType			=	RCC_OSCILLATORTYPE_LSE	|
									RCC_OSCILLATORTYPE_HSE,
		.HSEState				=	RCC_HSE_ON,
		.LSEState				=	RCC_LSE_ON,
		.HSEPredivValue			=	RCC_HSE_PREDIV_DIV1,
		.PLL = {
			.PLLState			=	RCC_PLL_ON,
			.PLLSource			=	RCC_PLLSOURCE_HSE,
			.PLLMUL				=	RCC_PLL_MUL9,
		}
	},
	.clk = {
		.ClockType				=	RCC_CLOCKTYPE_HCLK		|
									RCC_CLOCKTYPE_SYSCLK	|
									RCC_CLOCKTYPE_PCLK1		|
									RCC_CLOCKTYPE_PCLK2,

		.SYSCLKSource			=	RCC_SYSCLKSOURCE_PLLCLK,
		.AHBCLKDivider			=	RCC_SYSCLK_DIV1,
		.APB1CLKDivider			=	RCC_HCLK_DIV2,
		.APB2CLKDivider			=	RCC_HCLK_DIV1,
	},
	.periphclk = {
		.PeriphClockSelection	=	RCC_PERIPHCLK_RTC	|
									RCC_PERIPHCLK_USB,
		.RTCClockSelection		=	RCC_RTCCLKSOURCE_HSE_DIV128,
		.UsbClockSelection		=	RCC_USBCLKSOURCE_PLL_DIV1_5,

	},
};
////////////////////////////////////////////////////////////////////////////////
///***************************ALG RANDOM*************************************///
////////////////////////////////////////////////////////////////////////////////
static RandAlgNode RandAlgNode_Init[] = {
	{	.count		= 2,
		.rand_min	= 5,
		.delta		= 95,
	},{
		.count		= 17,
		.rand_min	= 1,
		.delta		= 30,
	},{
		.count		= 15,
		.rand_min	= 1,
		.delta		= 15,
	},{
		.count		= 7,
		.rand_min	= 1,
		.delta		= 0,
	}
};
//------------------------------------------------------------------------------
static RandAlg RandAlg_Init = {
	.node = RandAlgNode_Init,
	.node_sz = ARRAY_SIZE(RandAlgNode_Init),
	.min = 5,
	.max = 100,
};
////////////////////////////////////////////////////////////////////////////////
///***************************LED DIODE**************************************///
////////////////////////////////////////////////////////////////////////////////
static const GPIO_Device LED_GPIO_Init = {
		.gpio_init = {
			.Mode			= GPIO_MODE_OUTPUT_PP,
			.Speed			= GPIO_SPEED_FREQ_HIGH,
			.Pull			= GPIO_NOPULL,
			.Pin			= GPIO_PIN_8,
		},
		.gpio_type		= GPIOA,
};
////////////////////////////////////////////////////////////////////////////////
Struct_Device RandRollDevice = {
	.max2719				= &MAX2719_Init,
	.buttom					= &BUTTOM_Init,
	.hd44780_i2c			= &HD44780_I2C_Init,
	.rtc					= &RTC_Init,
	.tim3_base				= &TIM3_Base_Init,
	.uart_debug				= &UART_Debug_Init,
	.rcc					= &RCC_Init,
	.ra						= &RandAlg_Init,
	.led					= &LED_GPIO_Init,

	.flag_update_1hz		= 0,
	.flag_update_10hz		= 0,
	.flag_update_100hz		= 0
};
//------------------------------------------------------------------------------
